In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("train.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5847 entries, 0 to 5846
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         5847 non-null   int64
 1   Name               5847 non-null   object
 2   Location           5847 non-null   object
 3   Year               5847 non-null   int64
 4   Kilometers_Driven  5847 non-null   int64
 5   Fuel_Type          5847 non-null   object
 6   Transmission       5847 non-null   object
 7   Owner_Type         5847 non-null   object
 8   Mileage            5845 non-null   object
 9   Engine             5811 non-null   object
 10  Power              5811 non-null   object
 11  Seats              5809 non-null   float64
 12  New_Price          815 non-null    object
 13  Price              5847 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 639.6+ KB

### b) Remove the units from some of the attributes and only keep the numerical values (for example remove kmpl from “Mileage”, CC from “Engine”, bhp from “Power”, and lakh from “New_price”).

In [2]:
# Removing kmph from mileage attribute

df["Mileage"] = pd.to_numeric(df["Mileage"].str.replace('[^\d.]', '', regex=True), errors='coerce')

In [3]:
df["Mileage"]

0       19.67
1       13.00
2       20.77
3       15.20
4       23.08
        ...
5842    28.40
5843    24.40
5844    14.00
5845    18.90
5846    25.44
Name: Mileage, Length: 5847, dtype: float64

In [4]:
# Removing CC from engine attribute

df["Engine"] = pd.to_numeric(df["Engine"].str.replace('[^\d.]', '', regex=True), errors='coerce')

In [5]:
df["Engine"]

0       1582.0
1       1199.0
2       1248.0
3       1968.0
4       1461.0
         ...
5842    1248.0
5843    1120.0
5844    2498.0
5845     998.0
5846     936.0
Name: Engine, Length: 5847, dtype: float64

In [6]:
# Removing bhp from power attribute

df["Power"] = pd.to_numeric(df["Power"].str.replace('[^\d.]', '', regex=True), errors='coerce')

In [7]:
df["Power"]

0       126.20
1        88.70
2        88.76
3       140.80
4        63.10
         ...
5842     74.00
5843     71.00
5844    112.00
5845     67.10
5846     57.60
Name: Power, Length: 5847, dtype: float64

In [8]:
# Removing lakh from new_price attribute

df["New_Price"] = pd.to_numeric(df["New_Price"].str.replace('[^\d.]', '', regex=True), errors='coerce')

In [9]:
df["New_Price"]

0        NaN
1       8.61
2        NaN
3        NaN
4        NaN
        ...
5842    7.88
5843     NaN
5844     NaN
5845     NaN
5846     NaN
Name: New_Price, Length: 5847, dtype: float64

### c) Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value.

In [10]:
# Do the transmission mapping for the attribute
transmission_mapping = {"Automatic": 0, "Manual": 1}

# Apply label encoding to 'transmission' attribute
df["Transmission"] = df["Transmission"].map(transmission_mapping)

In [11]:
df["Transmission"]

0       1
1       1
2       1
3       0
4       1
       ..
5842    1
5843    1
5844    1
5845    1
5846    1
Name: Transmission, Length: 5847, dtype: int64

In [12]:
# Do the fuel_type mapping for the attribute
fuel_type_mapping = {"Diesel": 0, "Petrol": 1}

# Apply label encoding to 'transmission' attribute
df["Fuel_Type"] = df["Fuel_Type"].map(fuel_type_mapping)

In [13]:
df["Fuel_Type"]

0       0.0
1       1.0
2       0.0
3       0.0
4       0.0
       ...
5842    0.0
5843    0.0
5844    0.0
5845    1.0
5846    0.0
Name: Fuel_Type, Length: 5847, dtype: float64

### a) Look for the missing values in all the columns and either impute them (replace with mean, median, or mode) or drop them. Justify your action for this task

In [14]:
# data of mileage before imputing with mean 
df["New_Price"][:5847]

0        NaN
1       8.61
2        NaN
3        NaN
4        NaN
        ...
5842    7.88
5843     NaN
5844     NaN
5845     NaN
5846     NaN
Name: New_Price, Length: 5847, dtype: float64

In [15]:
# data of mileage after imputing with mean
df["New_Price"].fillna(df["New_Price"].mean(), inplace=True)

In [16]:
df["New_Price"]

0       20.484564
1        8.610000
2       20.484564
3       20.484564
4       20.484564
          ...
5842     7.880000
5843    20.484564
5844    20.484564
5845    20.484564
5846    20.484564
Name: New_Price, Length: 5847, dtype: float64

In [17]:
df["Mileage"].fillna(df["Mileage"].mean(), inplace=True)

In [18]:
df["Mileage"]

0       19.67
1       13.00
2       20.77
3       15.20
4       23.08
        ...
5842    28.40
5843    24.40
5844    14.00
5845    18.90
5846    25.44
Name: Mileage, Length: 5847, dtype: float64

In [19]:
df["Engine"].fillna(df["Engine"].mean(), inplace=True)
df["Engine"]

0       1582.0
1       1199.0
2       1248.0
3       1968.0
4       1461.0
         ...
5842    1248.0
5843    1120.0
5844    2498.0
5845     998.0
5846     936.0
Name: Engine, Length: 5847, dtype: float64

In [20]:
df["Power"].fillna(df["Power"].mean(), inplace=True)
df["Power"]

0       126.20
1        88.70
2        88.76
3       140.80
4        63.10
         ...
5842     74.00
5843     71.00
5844    112.00
5845     67.10
5846     57.60
Name: Power, Length: 5847, dtype: float64

In [21]:
df["Seats"].fillna(df["Seats"].mean(), inplace=True)
df["Seats"]

0       5.0
1       5.0
2       7.0
3       5.0
4       5.0
       ...
5842    5.0
5843    5.0
5844    8.0
5845    5.0
5846    5.0
Name: Seats, Length: 5847, dtype: float64

#### Mileage, Engine, Power, Seats and New_Price attributes having missing values, so Iam doing imputation with mean. By doing this imputation, the missing values will recover and there will be no loss of data. The dataset will be cleaned finally after doing imputation.

In [22]:
# Justifying the statement.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5847 entries, 0 to 5846
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         5847 non-null   int64
 1   Name               5847 non-null   object
 2   Location           5847 non-null   object
 3   Year               5847 non-null   int64
 4   Kilometers_Driven  5847 non-null   int64
 5   Fuel_Type          5845 non-null   float64
 6   Transmission       5847 non-null   int64
 7   Owner_Type         5847 non-null   object
 8   Mileage            5847 non-null   float64
 9   Engine             5847 non-null   float64
 10  Power              5847 non-null   float64
 11  Seats              5847 non-null   float64
 12  New_Price          5847 non-null   float64
 13  Price              5847 non-null   float64
dtypes: float64(7), int64(4), object(3)
memory usage: 639.6+ KB

### d) Create one more feature and add this column to the dataset (you can use mutate function in R for this). For example, you can calculate the current age of the car by subtracting “Year” value from the current year.

In [23]:
current_year = 2024
df["Age"] = current_year - df["Year"]

In [24]:
df["Age"]

0        9
1       13
2       12
3       11
4       11
        ..
5842    10
5843     9
5844    12
5845    11
5846    13
Name: Age, Length: 5847, dtype: int64

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5847 entries, 0 to 5846
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         5847 non-null   int64
 1   Name               5847 non-null   object
 2   Location           5847 non-null   object
 3   Year               5847 non-null   int64
 4   Kilometers_Driven  5847 non-null   int64
 5   Fuel_Type          5845 non-null   float64
 6   Transmission       5847 non-null   int64
 7   Owner_Type         5847 non-null   object
 8   Mileage            5847 non-null   float64
 9   Engine             5847 non-null   float64
 10  Power              5847 non-null   float64
 11  Seats              5847 non-null   float64
 12  New_Price          5847 non-null   float64
 13  Price              5847 non-null   float64
 14  Age                5847 non-null   int64
dtypes: float64(7), int64(5), object(3)
memory usage: 685.3+ KB

### e) Perform select, filter, rename, mutate, arrange and summarize with group by operations (or their equivalent operations in python) on this dataset.

In [26]:
selected_columns = df[['Location', 'Year', 'Kilometers_Driven', 'Power', 'Price']]
filtered_data = df[df['Year'] > 2015]
renamed_df = df.rename(columns={'Transmission': 'Transmission_Type', 'Seats': 'People_Capacity'})
sorted_df = df.sort_values(by='Price', ascending=False)
summary_stats = df.groupby('Fuel_Type')['Price'].mean()
summary_stats_complex = df.groupby('Fuel_Type').agg({'Price': ['mean', 'min', 'max']})

print("Selected Columns:")
print(selected_columns.head())

print("\nFiltered Data (Year > 2015):")
print(filtered_data.head())

print("\nRenamed Columns:")
print(renamed_df.head())

print("\nSorted by Price:")
print(sorted_df.head())

print("\nSummary Statistics (Mean Price by Fuel Type):")
print(summary_stats)

print("\nSummary Statistics (Complex):")
print(summary_stats_complex)

Selected Columns:
     Location  Year  Kilometers_Driven   Power  Price
0        Pune  2015              41000  126.20  12.50
1     Chennai  2011              46000   88.70   4.50
2     Chennai  2012              87000   88.76   6.00
3  Coimbatore  2013              40670  140.80  17.74
4      Jaipur  2013              86999   63.10   3.50

Filtered Data (Year > 2015):
    Unnamed: 0                               Name Location  Year  \
5            7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
8           10                   Maruti Ciaz Zeta    Kochi  2018
14          16              Honda Amaze S i-Dtech    Kochi  2016
15          17              Maruti Swift DDiS VDI   Jaipur  2017
26          28                Honda WRV i-VTEC VX    Kochi  2018

    Kilometers_Driven  Fuel_Type  Transmission Owner_Type  Mileage  Engine  \
5               36000        0.0             0      First    11.36  2755.0
8               25692        1.0             1      First    21.56  1462.0
14              58950        0.0             1      First    25.80  1498.0
15              25000        0.0             1      First    28.40  1248.0
26              37430        1.0             1      First    17.50  1199.0

     Power  Seats  New_Price  Price  Age
5   171.50    8.0  21.000000  17.50    8
8   103.25    5.0  10.650000   9.95    6
14   98.60    5.0  20.484564   5.40    8
15   74.00    5.0  20.484564   5.99    7
26   88.70    5.0  10.570000   9.90    6

Renamed Columns:
   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven  Fuel_Type  Transmission_Type Owner_Type  Mileage  \
0              41000        0.0                  1      First    19.67
1              46000        1.0                  1      First    13.00
2              87000        0.0                  1      First    20.77
3              40670        0.0                  0     Second    15.20
4              86999        0.0                  1      First    23.08

   Engine   Power  People_Capacity  New_Price  Price  Age
0  1582.0  126.20              5.0  20.484564  12.50    9
1  1199.0   88.70              5.0   8.610000   4.50   13
2  1248.0   88.76              7.0  20.484564   6.00   12
3  1968.0  140.80              5.0  20.484564  17.74   11
4  1461.0   63.10              5.0  20.484564   3.50   11

Sorted by Price:
      Unnamed: 0                                         Name    Location  \
3952        4079  Land Rover Range Rover 3.0 Diesel LWB Vogue   Hyderabad
5620        5781                   Lamborghini Gallardo Coupe       Delhi
5752        5919                       Jaguar F Type 5.0 V8 S   Hyderabad
1457        1505              Land Rover Range Rover Sport SE       Kochi
1917        1974                           BMW 7 Series 740Li  Coimbatore

      Year  Kilometers_Driven  Fuel_Type  Transmission Owner_Type  Mileage  \
3952  2017              25000        0.0             0      First    13.33
5620  2011               6500        1.0             0      Third     6.40
5752  2015               8000        1.0             0      First    12.50
1457  2019              26013        0.0             0      First    12.65
1917  2018              28060        1.0             0      First    12.05

      Engine  Power  Seats  New_Price   Price  Age
3952  2993.0  255.0    5.0   2.300000  160.00    7
5620  5204.0  560.0    2.0  20.484564  120.00   13
5752  5000.0  488.1    2.0  20.484564  100.00    9
1457  2993.0  255.0    5.0   1.390000   97.07    5
1917  2979.0  320.0    5.0  20.484564   93.67    6

Summary Statistics (Mean Price by Fuel Type):
Fuel_Type
0.0    12.960686
1.0     5.756688
Name: Price, dtype: float64

Summary Statistics (Complex):
               Price
                mean   min    max
Fuel_Type
0.0        12.960686  0.60  160.0
1.0         5.756688  0.44  120.0

In [27]:
with open('..//Assignment 2//results.txt', 'w') as file:
    # Selected Columns
    file.write("Selected Columns:\n")
    file.write(selected_columns.head().to_string(index=False))
    
    # Filtered Data (Year > 2015)
    file.write("\n\nFiltered Data (Year > 2015):\n")
    file.write(filtered_data.head().to_string(index=False))
    
    # Renamed Columns
    file.write("\n\nRenamed Columns:\n")
    file.write(renamed_df.head().to_string(index=False))
    
    # Sorted by Price
    file.write("\n\nSorted by Price:\n")
    file.write(sorted_df.head().to_string(index=False))
    
    # Summary Statistics (Mean Price by Fuel Type)
    file.write("\n\nSummary Statistics (Mean Price by Fuel Type):\n")
    file.write(summary_stats.to_string())
    
    # Summary Statistics (Complex)
    file.write("\n\nSummary Statistics (Complex):\n")
    file.write(summary_stats_complex.to_string())

In [28]:
df.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Age
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,0.0,1,First,19.67,1582.0,126.20,5.0,20.484564,12.50,9
1,2,Honda Jazz V,Chennai,2011,46000,1.0,1,First,13.00,1199.0,88.70,5.0,8.610000,4.50,13
2,3,Maruti Ertiga VDI,Chennai,2012,87000,0.0,1,First,20.77,1248.0,88.76,7.0,20.484564,6.00,12
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,0.0,0,Second,15.20,1968.0,140.80,5.0,20.484564,17.74,11
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,0.0,1,First,23.08,1461.0,63.10,5.0,20.484564,3.50,11